#!/bin/sh

# ==========================================
# ۱. تنظیم مجوزها
# ==========================================
chmod -R 775 storage bootstrap/cache

# ==========================================
# ۲. پاک کردن کش‌ها (سریع)
# ==========================================
php artisan config:clear
php artisan route:clear
php artisan view:clear

# ==========================================
# ۳. انتشار asset ها (سریع)
# ==========================================
php artisan filament:assets

# ==========================================
# ۴. کش کردن تنظیمات (سریع)
# ==========================================
php artisan config:cache
php artisan route:cache

# ==========================================
# ۵. اجرای PHP-FPM
# ==========================================
php-fpm -D

# ==========================================
# ۶. اجرای Nginx
# ==========================================
nginx -g 'daemon off;'